html/2014-02-02-Connecting-to-Google-Docs-With-Python.html
<html>
		<head>
			<link rel="stylesheet" href="../css/style.css" type="text/css" />




		</head>

		<body>
		<div id="container">

				<div id="col1">
					<div id=sidebar>
						<div class=svgContainer><a href="/"><svg id=homeIcon></svg></a></div>
						<div class=svgContainer><a href="mailto:analog@analogpxixel.org"><svg viewbox="0 0 40 40" id=mailIcon ></svg></a></div>
						<div class=svgContainer><a href="https://github.com/analogpixel"><svg viewbox="0 0 40 40" id=githubIcon></svg></a></div>
						<div class=svgContainer><a href="https://twitter.com/analogp1xel"><svg viewbox="0 0 40 40" id=twitterIcon></svg></a></div>
						<div class=svgContainer><a href="http://analog.smugmug.com"><svg viewbox="0 0 40 40" id=smugIcon></svg></a></div>
						<br><br>
						<div class=menuItem><a href=../html/2015-01-12-Clojure-Image-Processing.html>Clojure Image Processing</a></div><div class=menuItem><a href=../html/2014-12-21-Learning-AWK-With-AWK-Koans.html>Learning AWK With AWK Koans</a></div><div class=menuItem><a href=../html/2014-12-15-Sharepoint-Explosions.html>Sharepoint Explosions</a></div><div class=menuItem><a href=../html/2014-11-30-Alien-Mouse.html>Alien Mouse</a></div><div class=menuItem><a href=../html/2014-10-30-Lego-Image-Creator.html>Lego Image Creator</a></div><div class=menuItem><a href=../html/2014-02-02-Connecting-to-Google-Docs-With-Python.html>Connecting to Google Docs With Python</a></div>
					</div>
				</div>

				<div id="col2" >
						<div id=pageContent>
								<!-- TAGS: python,google,api -->

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Updating a google Docs spreadsheet in python</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This document will cover how to connect to a google docs spreadsheet
for reading and writing. Initially I set out to just use the google
apis directly to do this, but google makes them a pain to use, and
the information is jumbled between different version, and different
languages, so after I got the oauth2 authentication working, I ended
up using the python <a href="http://burnash.github.io/gspread/index.html">gspread</a> library to do all the heavy lifting.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Configuring your application for use.</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Before you can connect to google with oauth2, you'll need to connect to
the <a href="https://console.developers.google.com">Google Developers Console</a> and create a new project that has access to
do whatever it is you're trying to do.  When you create the credentials for
your new project, make sure to select service account so you don't need to
go through an authentication process each time you want to connect your
application.  When you are finished, you'll need the Email Address, and the
p12 key.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Python libraries</h3>
<div class="outline-text-3" id="text-1-3">
<p>
for windows I needed to install these libraries to get everything working:
</p>
<div class="org-src-container">

<pre class="src src-bat">c:\Python27\Scripts\pip install pyopenssl --<span style="color: #92a65e; font-weight: bold;">upgrade</span>
c:\Python27\Scripts\pip install --<span style="color: #92a65e; font-weight: bold;">upgrade</span> google-api-python-client
c:\Python27\Scripts\pip install gspread
</pre>
</div>
<p>
once everything was installed, you only need to import gspread to handle
dealing with the spreadsheets, and the oauth client to deal with google's
oauth2.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8ac6f2; font-weight: bold;">import</span> gspread
<span style="color: #8ac6f2; font-weight: bold;">from</span> oauth2client.client <span style="color: #8ac6f2; font-weight: bold;">import</span> SignedJwtAssertionCredentials
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Authentication</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Authentication is done using the email and p12 key you obtained in the
configuring your application section.  Using the SignedJwtAssertionCredentials
function, you'll get credentials you can then pass to other authorization functions.
</p>

<p>
One problem I ran into initially was I had the wrong scope added, so make sure you find
the correct scope (google for it) for whatever you are trying to do.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8ac6f2; font-weight: bold;">with</span> <span style="color: #e5786d;">file</span>(<span style="color: #95e454;">'key.p12'</span>, <span style="color: #95e454;">'rb'</span>) <span style="color: #8ac6f2; font-weight: bold;">as</span> key_file:
        <span style="color: #cae682;">key</span> = key_file.read()

<span style="color: #cae682;">credentials</span> = SignedJwtAssertionCredentials(
        <span style="color: #95e454;">'376360807684-q8iuiql4m7bgee6i1hu41c7ufnlse6hk@developer.gserviceaccount.com'</span>,
        key,
        scope=[<span style="color: #95e454;">'https://spreadsheets.google.com/feeds'</span>,
                                 <span style="color: #95e454;">'https://docs.google.com/feeds'</span>,
                                 <span style="color: #95e454;">'https://www.googleapis.com/auth/drive'</span>])
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Using gspread</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Now that you have a connection to google, you can use the gspread library to access that data.
Make sure that the email address you go from the configuring your application section has
access in the sharing tab of the spreadsheet you are trying to access.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #cae682;">gc</span> = gspread.authorize(credentials)
<span style="color: #cae682;">wks</span> = gc.<span style="color: #e5786d;">open</span>(<span style="color: #95e454;">"Pentest Remediation"</span>).sheet1
<span style="color: #8ac6f2; font-weight: bold;">print</span> wks.row_values(1)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://burnash.github.io/gspread/index.html">gspread api docs</a>
</li>
<li><a href="https://console.developers.google.com/project/gold-pod-840/apiui/api">Google Developers Console</a>
</li>
<li><a href="https://developers.google.com/drive/v2/reference/">Google Drive API ref</a>
</li>
<li><a href="https://developers.google.com/drive/web/scopes">https://developers.google.com/drive/web/scopes</a>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Connecting to Google Drive</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8ac6f2; font-weight: bold;">from</span> apiclient.discovery <span style="color: #8ac6f2; font-weight: bold;">import</span> build
<span style="color: #8ac6f2; font-weight: bold;">import</span> httplib2
<span style="color: #8ac6f2; font-weight: bold;">from</span> oauth2client.client <span style="color: #8ac6f2; font-weight: bold;">import</span> SignedJwtAssertionCredentials

<span style="color: #cae682;">http</span> = httplib2.Http()
<span style="color: #cae682;">http</span> = credentials.authorize(http)
<span style="color: #cae682;">drive</span> = build(<span style="color: #95e454;">'drive'</span>,<span style="color: #95e454;">'v2'</span>, http=http)
<span style="color: #8ac6f2; font-weight: bold;">print</span> drive.files().<span style="color: #e5786d;">list</span>().execute()
<span style="color: #8ac6f2; font-weight: bold;">print</span> drive.properties().<span style="color: #e5786d;">list</span>(
        fileId=<span style="color: #95e454;">"1IX4JnJlET5wN6efVUOs4VLreyG_fsC68uxr6hrFyoQY"</span>).execute()
</pre>
</div>
</div>
</div>

						</div>
				</div>

		</div>
		</body>
</html>
